# Задача 30: Заполните массив элементами арифметической
# прогрессии. Её первый элемент, разность и количество
# элементов нужно ввести с клавиатуры. Формула для
# получения n-го члена прогрессии: a
# n = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

number = int(input('Введите 1 элемент массива: '))
step = int(input('Введите шаг: '))
size = int(input('Введите размер массива: '))

list_1 = []
list_1.append(number)
for i in range(2, size + 1):
    list_1.append(list_1[0] + (i-1) * step)
print(list_1)
